{
  "api_to_idx": {
    "<PAD>": 0,
    "<UNK>": 1,
    "CertControlStore": 2,
    "CertOpenStore": 3,
    "CoCreateInstance": 4,
    "CoCreateInstanceEx": 5,
    "CoGetClassObject": 6,
    "CoInitializeEx": 7,
    "CoInitializeSecurity": 8,
    "CoUninitialize": 9,
    "CopyFileA": 10,
    "CopyFileW": 11,
    "CreateActCtxW": 12,
    "CreateDirectoryW": 13,
    "CreateJobObjectW": 14,
    "CreateProcessInternalW": 15,
    "CreateRemoteThread": 16,
    "CreateServiceA": 17,
    "CreateServiceW": 18,
    "CreateThread": 19,
    "CreateToolhelp32Snapshot": 20,
    "CryptAcquireContextA": 21,
    "CryptAcquireContextW": 22,
    "CryptCreateHash": 23,
    "CryptDecodeObjectEx": 24,
    "CryptExportKey": 25,
    "CryptHashData": 26,
    "CryptUnprotectData": 27,
    "DecryptMessage": 28,
    "DeleteFileW": 29,
    "DeviceIoControl": 30,
    "DrawTextExA": 31,
    "DrawTextExW": 32,
    "EncryptMessage": 33,
    "EnumWindows": 34,
    "FindFirstFileExW": 35,
    "FindResourceA": 36,
    "FindResourceExA": 37,
    "FindResourceExW": 38,
    "FindResourceW": 39,
    "FindWindowA": 40,
    "FindWindowExA": 41,
    "FindWindowExW": 42,
    "FindWindowW": 43,
    "GetAdaptersAddresses": 44,
    "GetAdaptersInfo": 45,
    "GetAddrInfoW": 46,
    "GetAsyncKeyState": 47,
    "GetBestInterfaceEx": 48,
    "GetComputerNameA": 49,
    "GetComputerNameW": 50,
    "GetCursorPos": 51,
    "GetDiskFreeSpaceExW": 52,
    "GetDiskFreeSpaceW": 53,
    "GetFileAttributesExW": 54,
    "GetFileAttributesW": 55,
    "GetFileInformationByHandle": 56,
    "GetFileInformationByHandleEx": 57,
    "GetFileSize": 58,
    "GetFileSizeEx": 59,
    "GetFileType": 60,
    "GetFileVersionInfoExW": 61,
    "GetFileVersionInfoSizeExW": 62,
    "GetFileVersionInfoSizeW": 63,
    "GetFileVersionInfoW": 64,
    "GetForegroundWindow": 65,
    "GetKeyState": 66,
    "GetKeyboardState": 67,
    "GetNativeSystemInfo": 68,
    "GetShortPathNameW": 69,
    "GetSystemDirectoryA": 70,
    "GetSystemDirectoryW": 71,
    "GetSystemInfo": 72,
    "GetSystemMetrics": 73,
    "GetSystemTimeAsFileTime": 74,
    "GetSystemWindowsDirectoryA": 75,
    "GetSystemWindowsDirectoryW": 76,
    "GetTempPathW": 77,
    "GetTimeZoneInformation": 78,
    "GetUserNameA": 79,
    "GetUserNameExA": 80,
    "GetUserNameExW": 81,
    "GetUserNameW": 82,
    "GetVolumeNameForVolumeMountPointW": 83,
    "GetVolumePathNameW": 84,
    "GetVolumePathNamesForVolumeNameW": 85,
    "GlobalMemoryStatus": 86,
    "GlobalMemoryStatusEx": 87,
    "HttpOpenRequestA": 88,
    "HttpOpenRequestW": 89,
    "HttpQueryInfoA": 90,
    "HttpSendRequestA": 91,
    "HttpSendRequestW": 92,
    "IWbemServices_ExecQuery": 93,
    "InternetCloseHandle": 94,
    "InternetConnectA": 95,
    "InternetConnectW": 96,
    "InternetCrackUrlA": 97,
    "InternetCrackUrlW": 98,
    "InternetGetConnectedState": 99,
    "InternetOpenA": 100,
    "InternetOpenUrlA": 101,
    "InternetOpenUrlW": 102,
    "InternetOpenW": 103,
    "InternetQueryOptionA": 104,
    "InternetReadFile": 105,
    "InternetSetOptionA": 106,
    "InternetSetStatusCallback": 107,
    "IsDebuggerPresent": 108,
    "LdrGetDllHandle": 109,
    "LdrGetProcedureAddress": 110,
    "LdrLoadDll": 111,
    "LdrUnloadDll": 112,
    "LoadResource": 113,
    "LoadStringA": 114,
    "LoadStringW": 115,
    "LookupAccountSidW": 116,
    "LookupPrivilegeValueW": 117,
    "MessageBoxTimeoutA": 118,
    "MessageBoxTimeoutW": 119,
    "Module32FirstW": 120,
    "Module32NextW": 121,
    "MoveFileWithProgressW": 122,
    "NetGetJoinInformation": 123,
    "NetShareEnum": 124,
    "NtAllocateVirtualMemory": 125,
    "NtClose": 126,
    "NtCreateFile": 127,
    "NtCreateKey": 128,
    "NtCreateMutant": 129,
    "NtCreateSection": 130,
    "NtCreateThreadEx": 131,
    "NtDelayExecution": 132,
    "NtDeleteKey": 133,
    "NtDeviceIoControlFile": 134,
    "NtDuplicateObject": 135,
    "NtEnumerateKey": 136,
    "NtEnumerateValueKey": 137,
    "NtFreeVirtualMemory": 138,
    "NtGetContextThread": 139,
    "NtMapViewOfSection": 140,
    "NtOpenDirectoryObject": 141,
    "NtOpenFile": 142,
    "NtOpenKey": 143,
    "NtOpenKeyEx": 144,
    "NtOpenMutant": 145,
    "NtOpenProcess": 146,
    "NtOpenSection": 147,
    "NtOpenThread": 148,
    "NtProtectVirtualMemory": 149,
    "NtQueryAttributesFile": 150,
    "NtQueryDirectoryFile": 151,
    "NtQueryFullAttributesFile": 152,
    "NtQueryInformationFile": 153,
    "NtQueryKey": 154,
    "NtQueryMultipleValueKey": 155,
    "NtQuerySystemInformation": 156,
    "NtQueryValueKey": 157,
    "NtQueueApcThread": 158,
    "NtReadFile": 159,
    "NtReadVirtualMemory": 160,
    "NtResumeThread": 161,
    "NtSetContextThread": 162,
    "NtSetInformationFile": 163,
    "NtSetValueKey": 164,
    "NtSuspendThread": 165,
    "NtTerminateProcess": 166,
    "NtTerminateThread": 167,
    "NtUnmapViewOfSection": 168,
    "NtWriteFile": 169,
    "ObtainUserAgentString": 170,
    "OleInitialize": 171,
    "OpenSCManagerA": 172,
    "OpenSCManagerW": 173,
    "OpenServiceA": 174,
    "OpenServiceW": 175,
    "OutputDebugStringA": 176,
    "Process32FirstW": 177,
    "Process32NextW": 178,
    "ReadCabinetState": 179,
    "ReadProcessMemory": 180,
    "RegCloseKey": 181,
    "RegCreateKeyExA": 182,
    "RegCreateKeyExW": 183,
    "RegDeleteKeyA": 184,
    "RegDeleteKeyW": 185,
    "RegDeleteValueA": 186,
    "RegDeleteValueW": 187,
    "RegEnumKeyExA": 188,
    "RegEnumKeyExW": 189,
    "RegEnumKeyW": 190,
    "RegEnumValueA": 191,
    "RegEnumValueW": 192,
    "RegOpenKeyExA": 193,
    "RegOpenKeyExW": 194,
    "RegQueryInfoKeyA": 195,
    "RegQueryInfoKeyW": 196,
    "RegQueryValueExA": 197,
    "RegQueryValueExW": 198,
    "RegSetValueExA": 199,
    "RegSetValueExW": 200,
    "RegisterHotKey": 201,
    "RemoveDirectoryA": 202,
    "RemoveDirectoryW": 203,
    "RtlAddVectoredContinueHandler": 204,
    "RtlAddVectoredExceptionHandler": 205,
    "RtlRemoveVectoredExceptionHandler": 206,
    "SHGetFolderPathW": 207,
    "SHGetSpecialFolderLocation": 208,
    "SearchPathW": 209,
    "SendNotifyMessageA": 210,
    "SendNotifyMessageW": 211,
    "SetEndOfFile": 212,
    "SetErrorMode": 213,
    "SetFileAttributesW": 214,
    "SetFileInformationByHandle": 215,
    "SetFilePointer": 216,
    "SetFilePointerEx": 217,
    "SetFileTime": 218,
    "SetInformationJobObject": 219,
    "SetStdHandle": 220,
    "SetUnhandledExceptionFilter": 221,
    "SetWindowsHookExA": 222,
    "SetWindowsHookExW": 223,
    "ShellExecuteExW": 224,
    "SizeofResource": 225,
    "StartServiceA": 226,
    "StartServiceW": 227,
    "Thread32First": 228,
    "Thread32Next": 229,
    "UnhookWindowsHookEx": 230,
    "UuidCreate": 231,
    "WSAConnect": 232,
    "WSARecv": 233,
    "WSASend": 234,
    "WSASocketA": 235,
    "WSASocketW": 236,
    "WSAStartup": 237,
    "WriteConsoleA": 238,
    "WriteConsoleW": 239,
    "WriteProcessMemory": 240,
    "__exception__": 241,
    "bind": 242,
    "closesocket": 243,
    "connect": 244,
    "getaddrinfo": 245,
    "gethostbyname": 246,
    "getsockname": 247,
    "ioctlsocket": 248,
    "listen": 249,
    "recv": 250,
    "select": 251,
    "send": 252,
    "setsockopt": 253,
    "shutdown": 254,
    "socket": 255,
    "timeGetTime": 256
  },
  "idx_to_api": {
    "0": "<PAD>",
    "1": "<UNK>",
    "2": "CertControlStore",
    "3": "CertOpenStore",
    "4": "CoCreateInstance",
    "5": "CoCreateInstanceEx",
    "6": "CoGetClassObject",
    "7": "CoInitializeEx",
    "8": "CoInitializeSecurity",
    "9": "CoUninitialize",
    "10": "CopyFileA",
    "11": "CopyFileW",
    "12": "CreateActCtxW",
    "13": "CreateDirectoryW",
    "14": "CreateJobObjectW",
    "15": "CreateProcessInternalW",
    "16": "CreateRemoteThread",
    "17": "CreateServiceA",
    "18": "CreateServiceW",
    "19": "CreateThread",
    "20": "CreateToolhelp32Snapshot",
    "21": "CryptAcquireContextA",
    "22": "CryptAcquireContextW",
    "23": "CryptCreateHash",
    "24": "CryptDecodeObjectEx",
    "25": "CryptExportKey",
    "26": "CryptHashData",
    "27": "CryptUnprotectData",
    "28": "DecryptMessage",
    "29": "DeleteFileW",
    "30": "DeviceIoControl",
    "31": "DrawTextExA",
    "32": "DrawTextExW",
    "33": "EncryptMessage",
    "34": "EnumWindows",
    "35": "FindFirstFileExW",
    "36": "FindResourceA",
    "37": "FindResourceExA",
    "38": "FindResourceExW",
    "39": "FindResourceW",
    "40": "FindWindowA",
    "41": "FindWindowExA",
    "42": "FindWindowExW",
    "43": "FindWindowW",
    "44": "GetAdaptersAddresses",
    "45": "GetAdaptersInfo",
    "46": "GetAddrInfoW",
    "47": "GetAsyncKeyState",
    "48": "GetBestInterfaceEx",
    "49": "GetComputerNameA",
    "50": "GetComputerNameW",
    "51": "GetCursorPos",
    "52": "GetDiskFreeSpaceExW",
    "53": "GetDiskFreeSpaceW",
    "54": "GetFileAttributesExW",
    "55": "GetFileAttributesW",
    "56": "GetFileInformationByHandle",
    "57": "GetFileInformationByHandleEx",
    "58": "GetFileSize",
    "59": "GetFileSizeEx",
    "60": "GetFileType",
    "61": "GetFileVersionInfoExW",
    "62": "GetFileVersionInfoSizeExW",
    "63": "GetFileVersionInfoSizeW",
    "64": "GetFileVersionInfoW",
    "65": "GetForegroundWindow",
    "66": "GetKeyState",
    "67": "GetKeyboardState",
    "68": "GetNativeSystemInfo",
    "69": "GetShortPathNameW",
    "70": "GetSystemDirectoryA",
    "71": "GetSystemDirectoryW",
    "72": "GetSystemInfo",
    "73": "GetSystemMetrics",
    "74": "GetSystemTimeAsFileTime",
    "75": "GetSystemWindowsDirectoryA",
    "76": "GetSystemWindowsDirectoryW",
    "77": "GetTempPathW",
    "78": "GetTimeZoneInformation",
    "79": "GetUserNameA",
    "80": "GetUserNameExA",
    "81": "GetUserNameExW",
    "82": "GetUserNameW",
    "83": "GetVolumeNameForVolumeMountPointW",
    "84": "GetVolumePathNameW",
    "85": "GetVolumePathNamesForVolumeNameW",
    "86": "GlobalMemoryStatus",
    "87": "GlobalMemoryStatusEx",
    "88": "HttpOpenRequestA",
    "89": "HttpOpenRequestW",
    "90": "HttpQueryInfoA",
    "91": "HttpSendRequestA",
    "92": "HttpSendRequestW",
    "93": "IWbemServices_ExecQuery",
    "94": "InternetCloseHandle",
    "95": "InternetConnectA",
    "96": "InternetConnectW",
    "97": "InternetCrackUrlA",
    "98": "InternetCrackUrlW",
    "99": "InternetGetConnectedState",
    "100": "InternetOpenA",
    "101": "InternetOpenUrlA",
    "102": "InternetOpenUrlW",
    "103": "InternetOpenW",
    "104": "InternetQueryOptionA",
    "105": "InternetReadFile",
    "106": "InternetSetOptionA",
    "107": "InternetSetStatusCallback",
    "108": "IsDebuggerPresent",
    "109": "LdrGetDllHandle",
    "110": "LdrGetProcedureAddress",
    "111": "LdrLoadDll",
    "112": "LdrUnloadDll",
    "113": "LoadResource",
    "114": "LoadStringA",
    "115": "LoadStringW",
    "116": "LookupAccountSidW",
    "117": "LookupPrivilegeValueW",
    "118": "MessageBoxTimeoutA",
    "119": "MessageBoxTimeoutW",
    "120": "Module32FirstW",
    "121": "Module32NextW",
    "122": "MoveFileWithProgressW",
    "123": "NetGetJoinInformation",
    "124": "NetShareEnum",
    "125": "NtAllocateVirtualMemory",
    "126": "NtClose",
    "127": "NtCreateFile",
    "128": "NtCreateKey",
    "129": "NtCreateMutant",
    "130": "NtCreateSection",
    "131": "NtCreateThreadEx",
    "132": "NtDelayExecution",
    "133": "NtDeleteKey",
    "134": "NtDeviceIoControlFile",
    "135": "NtDuplicateObject",
    "136": "NtEnumerateKey",
    "137": "NtEnumerateValueKey",
    "138": "NtFreeVirtualMemory",
    "139": "NtGetContextThread",
    "140": "NtMapViewOfSection",
    "141": "NtOpenDirectoryObject",
    "142": "NtOpenFile",
    "143": "NtOpenKey",
    "144": "NtOpenKeyEx",
    "145": "NtOpenMutant",
    "146": "NtOpenProcess",
    "147": "NtOpenSection",
    "148": "NtOpenThread",
    "149": "NtProtectVirtualMemory",
    "150": "NtQueryAttributesFile",
    "151": "NtQueryDirectoryFile",
    "152": "NtQueryFullAttributesFile",
    "153": "NtQueryInformationFile",
    "154": "NtQueryKey",
    "155": "NtQueryMultipleValueKey",
    "156": "NtQuerySystemInformation",
    "157": "NtQueryValueKey",
    "158": "NtQueueApcThread",
    "159": "NtReadFile",
    "160": "NtReadVirtualMemory",
    "161": "NtResumeThread",
    "162": "NtSetContextThread",
    "163": "NtSetInformationFile",
    "164": "NtSetValueKey",
    "165": "NtSuspendThread",
    "166": "NtTerminateProcess",
    "167": "NtTerminateThread",
    "168": "NtUnmapViewOfSection",
    "169": "NtWriteFile",
    "170": "ObtainUserAgentString",
    "171": "OleInitialize",
    "172": "OpenSCManagerA",
    "173": "OpenSCManagerW",
    "174": "OpenServiceA",
    "175": "OpenServiceW",
    "176": "OutputDebugStringA",
    "177": "Process32FirstW",
    "178": "Process32NextW",
    "179": "ReadCabinetState",
    "180": "ReadProcessMemory",
    "181": "RegCloseKey",
    "182": "RegCreateKeyExA",
    "183": "RegCreateKeyExW",
    "184": "RegDeleteKeyA",
    "185": "RegDeleteKeyW",
    "186": "RegDeleteValueA",
    "187": "RegDeleteValueW",
    "188": "RegEnumKeyExA",
    "189": "RegEnumKeyExW",
    "190": "RegEnumKeyW",
    "191": "RegEnumValueA",
    "192": "RegEnumValueW",
    "193": "RegOpenKeyExA",
    "194": "RegOpenKeyExW",
    "195": "RegQueryInfoKeyA",
    "196": "RegQueryInfoKeyW",
    "197": "RegQueryValueExA",
    "198": "RegQueryValueExW",
    "199": "RegSetValueExA",
    "200": "RegSetValueExW",
    "201": "RegisterHotKey",
    "202": "RemoveDirectoryA",
    "203": "RemoveDirectoryW",
    "204": "RtlAddVectoredContinueHandler",
    "205": "RtlAddVectoredExceptionHandler",
    "206": "RtlRemoveVectoredExceptionHandler",
    "207": "SHGetFolderPathW",
    "208": "SHGetSpecialFolderLocation",
    "209": "SearchPathW",
    "210": "SendNotifyMessageA",
    "211": "SendNotifyMessageW",
    "212": "SetEndOfFile",
    "213": "SetErrorMode",
    "214": "SetFileAttributesW",
    "215": "SetFileInformationByHandle",
    "216": "SetFilePointer",
    "217": "SetFilePointerEx",
    "218": "SetFileTime",
    "219": "SetInformationJobObject",
    "220": "SetStdHandle",
    "221": "SetUnhandledExceptionFilter",
    "222": "SetWindowsHookExA",
    "223": "SetWindowsHookExW",
    "224": "ShellExecuteExW",
    "225": "SizeofResource",
    "226": "StartServiceA",
    "227": "StartServiceW",
    "228": "Thread32First",
    "229": "Thread32Next",
    "230": "UnhookWindowsHookEx",
    "231": "UuidCreate",
    "232": "WSAConnect",
    "233": "WSARecv",
    "234": "WSASend",
    "235": "WSASocketA",
    "236": "WSASocketW",
    "237": "WSAStartup",
    "238": "WriteConsoleA",
    "239": "WriteConsoleW",
    "240": "WriteProcessMemory",
    "241": "__exception__",
    "242": "bind",
    "243": "closesocket",
    "244": "connect",
    "245": "getaddrinfo",
    "246": "gethostbyname",
    "247": "getsockname",
    "248": "ioctlsocket",
    "249": "listen",
    "250": "recv",
    "251": "select",
    "252": "send",
    "253": "setsockopt",
    "254": "shutdown",
    "255": "socket",
    "256": "timeGetTime"
  },
  "vocab_size": 257,
  "max_seq_length": 101,
  "pad_idx": 0,
  "unk_idx": 1
}